{
    "Jobs": [
        {"short": "SWE", "years": "2023-Present", "header": "Capital One - Software Engineer", "image":  "http://localhost/assets/capitalone.png", "description": "This is my current job. I work on team that supports Capital One's alerting system of choice: PagerDuty. On a day to day basis I can be doing anything from developing scripts/plug-ins to various duties to maintaining AWS infrastructure. \n Some highlights have been:\n\t - Using multithreading to acheive a 17.5x speed up on scripts that previously took hours in order to meet AWS Lambda's 15 minute time limit \n\t - Was selected to present at Capital One's internal technology conference about improving Python code's performance \n\t - Engineered a microservice utilizing an AWS Fargate container to identify and tag PagerDuty teams based on Capital One internal team name data \n\t - Redesigned OAuth process to access PagerDuty's API to help facilitate transition to scoped API tokens \n\t - Created script to revoke inactive user access saving thousands of dollars worth of licenses monthly"},
        {"short": "SWE Intern", "years": "2022", "header": "Capital One - Software Engineering Intern", "image":  "/src/assets/logos/capitalone.png", "description": "This was my first time working as a true SWE. This is where I began to learn all of the things that they gloss over in school: version control, CI/CD, cloud infrastructure, maintainable code, security standards and even just what to say in a stand up meeting. \nSome of the highlights were:\n\t - Worked on team building on top of the Grafana platform (React, Angular, Go, PostgreSQL)\n\t - Engineered a tool to automate data recovery using AWS Lambdas written in Python.\n\t - Reduced the time to recover data from 2-3 days to minutes. Utilized AWS RDS, S3, Athena, EventBridge, and DMS in creating the Lambdas."},
        {"short": "Data Analyst", "years": "2020-2021", "header": "Virginia Tech CEE Department - Data Analyst", "image":  "/src/assets/logos/vt.png", "description": "Before I was a Computer Science student I was a Civil Engineering student. I pursued research under Dr. Tripp Shealy and ended up becoming a data analyst in this position. I was trusted as being the only person writing code on this project so I learned a great deal about Python through trial and error. Through this research, I realized that I enjoyed writing code more than Civil Engineering and right before my junior year I switched majors. I am still very passionate about green engineering and sustainability but I love my new career. Here are some highlights below: \n\t - Used Python libraries NumPy and Pandas to analyze thousands of survey responses related to civil engineering students' beliefs in climate change.\n\t - Prepared reports presenting statistical results of independent tTests, chiSquare and MannWhitneyU."},
        {"short": "Construction Engineer Intern", "years": "2020", "header": "Samet Corporation - Construction Engineering Intern", "image":  "/src/assets/logos/samet.png", "description": "As I talk about in the Data Analyst section, I used to be a Civil Engineering student. During this time I got to intern for a construction company. I think this is a very important part in telling the story of who I am as a professional. I gained so much leadership experience working for a general contractor. The main project I worked on was an airplane wing manufacturing facility for HondaJet. I learned a lot about project management and also served as the middleman between the superintendent and the subcontractors. I oversaw close to 200 hundred workers a day and had to work with the subcontractors to make sure the project was getting done ontime. For about a month I was pulled off of this jobsite and trusted with being the only member of the general contractor on a smaller renovation job for a pharmecutical company. This means that I was sole boss onsite. This is not an opportunity that most interns get but I grew so much in those few weeks as a result. I credit this experience for greatly developing my professional leadership skills."},
        {"short": "Other Jobs", "years": "2016-2020", "header": "All of my Other Jobs", "image":  "/src/assets/logos/work.png", "description": "I've worked a bunch of fun jobs throughout highschool and going into college and learned things from all of them:\n\nPersonal Trainer - VT Rec Sport - (2019-2021): I was an ACE Certified Personal Trainer, this was such a fun job that allowed me to make money with one of passions and I learned a lot about 1-1 communication in a professional setting. \n\nServer/Host - Burger Warfare - (2017-2018): I worked as a host and then a server for a burger restaurant, working in the food industry was a good experience and taught me alot about customer service. \n\nMaintenence Crew - Kick Ass Concepts - (2016): I count this as my first real job, I worked on a maintenence crew for a restuarant and entertainment group. There was always a new problem to solve everday and I had fun getting my hands dirty. \n\nYouth Lacrosse Referee - PCLA - (2016-2017): I refereed U9 - U13 games for 2 years. I loved playing lacrosse growing up but this is still by far the most stressful job I have worked. Being yelled at by parents 2-3x my age for 2 hours straight about how little I know about lacrosse certainly gave me some thicker skin."}
    ]
}